capa-99/STM32F401VE-driver-development/USART drivers/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include <stm32f401xe.h>

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
 // HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  int mstr = 1;

  if(mstr)
  {
	  RCC->AHB1ENR = RCC->AHB1ENR | 0x1;
	  RCC->AHB1ENR = RCC->AHB1ENR | 0x8;
	  GPIOA->MODER = GPIOA->MODER | 0x2AA0000;
	  GPIOA->AFR[1] = GPIOA->AFR[1] | 0x77777;
	  GPIOD->MODER = GPIOD->MODER | 0x0055;
	  RCC->APB2ENR = RCC->APB2ENR | 0x10;
	  USART1->BRR = 9600;
	  USART1->CR1 = USART1->CR1 | 0xC;
	  USART1->CR2 = USART1->CR2 | 0x0;
	  USART1->CR3 = USART1->CR3 | 0x0;
	  USART1->CR1 = USART1->CR1 | 0x2000;
	  uint16_t i = 0;
	  /*while(i < 100)
	  {
		  for(int j = 0; j < 1000; j++);

		  while(!(USART1->SR & 0x80));
		  USART1->DR = 0x4;
		  i++;
	  }*/
	  while(1)
	  {
	  		while(!(USART1->SR & 0x20));
	  		GPIOD->ODR = USART1->DR;
	  }
  }
  else
  {
	  RCC->AHB1ENR = RCC->AHB1ENR | 0x1;
	  RCC->AHB1ENR = RCC->AHB1ENR | 0x8;
	  GPIOA->MODER = GPIOA->MODER | 0x2AA0000;
	  GPIOA->AFR[1] = GPIOA->AFR[1] | 0x77777;
	  GPIOD->MODER = GPIOD->MODER | 0x0055;
	  GPIOD->ODR = 0x1;
	  RCC->APB2ENR = RCC->APB2ENR | 0x10;
	  USART1->BRR = 1667;
	  USART1->CR1 = USART1->CR1 | 0xC;
	  USART1->CR2 = USART1->CR2 | 0x0;
	  USART1->CR3 = USART1->CR3 | 0x0;
	  USART1->CR1 = USART1->CR1 | 0x2000;
	  while(!(USART1->SR & 0x20));
	  GPIOD->ODR = USART1->DR;
  }




  while (1)
  {


    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }

  	  return 0;
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  /*RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage

  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }*/
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
